run/twoCavities/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)

    (1 0 0)
    (2 0 0)
    (2 1 0)
    (1 1 0)
    (1 0 0.1)
    (2 0 0.1)
    (2 1 0.1)
    (1 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (10 10 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall movingWall
    (
        (3 7 6 2)
    )
    wall left
    (
        (0 4 7 3)
    )
    wall right
    (
        (2 6 5 1)
    )
    wall bottom
    (
        (1 5 4 0)
    )

    wall movingWall2
    (
        (11 15 14 10)
    )
    wall left2
    (
        (8 12 15 11)
    )
    wall right2
    (
        (10 14 13 9)
    )
    wall bottom2
    (
        (9 13 12 8)
    )

    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
        (8 11 10 9)
        (12 13 14 15)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
